app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "haii"], ["user_id", 1], ["room_id", 1], ["created_at", "2023-01-05 03:29:31.326882"], ["updated_at", "2023-01-05 03:29:31.326882"]]
---
  def create
    @message = Message.new(message_params)
    @message.user = current_user
    @message.save